fonecmid-diplom-main/fonecmid-diplom-main/diplom-src/src/Documents/ВКМ_ГрафикОтпусков/ВКМ_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ГрафикОтпусков</name>
  <registerRecords>InformationRegister.ВКМ_ГрафикОтпусков</registerRecords>
  <attributes>
    <name>Год</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтпускаСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom-main/fonecmid-diplom-main/diplom-src/src/Documents/ВКМ_ГрафикОтпусков/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОтпускаСотрудниковПроверка();
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовТаблицыФормыОтпускаСотрудников

&НаКлиенте
Процедура ОтпускаСотрудниковПриИзменении(Элемент)
	ОтпускаСотрудниковПроверка();
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура АнализГрафика(Команда)
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Данные", АнализГрафикаСервер());
	ОткрытьФорму("Документ.ВКМ_ГрафикОтпусков.Форма.АнализГрафика", ПараметрыФормы);
КонецПроцедуры

&НаСервере
Функция АнализГрафикаСервер()
	АдресВХранилище = ПоместитьВоВременноеХранилище(Объект.ОтпускаСотрудников.Выгрузить(), УникальныйИдентификатор);
	Возврат АдресВХранилище;	
КонецФункции

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОтпускаСотрудниковПроверка()
	Соответствие = Новый Соответствие();
	
	Для Каждого Строка Из Объект.ОтпускаСотрудников Цикл
		КоличествоДнейВСтроке = (Строка.ДатаОкончания - Строка.ДатаНачала) / 86400;
		КоличествоДнейСотрудника = Соответствие.Получить(Строка.Сотрудник);
		
		Если КоличествоДнейСотрудника <> Неопределено Тогда
			ИтогоКоличествоДней = КоличествоДнейСотрудника + КоличествоДнейВСтроке;
		Иначе 
			ИтогоКоличествоДней = КоличествоДнейВСтроке;
		КонецЕсли;
		Соответствие.Вставить(Строка.Сотрудник, ИтогоКоличествоДней);
	КонецЦикла;
	
	СписокЗначенийКрасный = Новый СписокЗначений();
	СписокЗначенийБелый = Новый СписокЗначений();
	
	Для Каждого Элемент Из Соответствие Цикл
		Если Элемент.Значение > 28 Тогда
			СписокЗначенийКрасный.Добавить(Элемент.Ключ);	
		Иначе
			СписокЗначенийБелый.Добавить(Элемент.Ключ);
		КонецЕсли;
	КонецЦикла;	
	
	ОтпускаСотрудниковПриИзмененииСервер(СписокЗначенийКрасный, СписокЗначенийБелый);
КонецПроцедуры

&НаСервере
Процедура ОтпускаСотрудниковПриИзмененииСервер(СписокЗначенийКрасный, СписокЗначенийБелый)
	
	УО = УсловноеОформление.Элементы.Добавить();
	УО.Использование = Истина;
	УО.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.БледноКрасноФиолетовый);
			
	ЭлементУсловия = УО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));		
	ЭлементУсловия.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ОтпускаСотрудников.Сотрудник");		
	ЭлементУсловия.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
	ЭлементУсловия.ПравоеЗначение = СписокЗначенийКрасный;
	ЭлементУсловия.Использование = Истина;
				
	ОформляемоеПоле = УО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ОтпускаСотрудников");
	ОформляемоеПоле.Использование = Истина;
	
	
	УО = УсловноеОформление.Элементы.Добавить();
	УО.Использование = Истина;
	УО.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Белый);
			
	ЭлементУсловия = УО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));		
	ЭлементУсловия.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ОтпускаСотрудников.Сотрудник");		
	ЭлементУсловия.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
	ЭлементУсловия.ПравоеЗначение = СписокЗначенийБелый;
	ЭлементУсловия.Использование = Истина;
				
	ОформляемоеПоле = УО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ОтпускаСотрудников");
	ОформляемоеПоле.Использование = Истина;
	
КонецПроцедуры

#КонецОбласти
